# Tcl script to extract paths from the physical database of a module and generate a JSON file with them

# Parse arguments
if { ![info exists ::env(DESIGN_NAME)] || 
     ![info exists ::env(NUM_PATHS)] || 
     ![info exists ::env(PATHS_FILE)] } {
	puts "Error: Missing environment variables."
	puts "Please ensure DESIGN_NAME, NUM_PATHS, and PATHS_FILE are exported."
	exit 1
}

set design_name $::env(DESIGN_NAME)
set num_paths $::env(NUM_PATHS)
set paths_file $::env(PATHS_FILE)

puts "================= OpenROAD Path Extraction ================"
puts " Module name: $design_name"
puts " #Paths to monitor: $num_paths"
puts "==========================================================="

set db_file "workspace/${design_name}/odb/${design_name}.odb"
set sdc_file "workspace/${design_name}/sdc/${design_name}.sdc"

# Load timing models (Liberty file)
read_liberty "/foss/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib"

# Load the physical database generated by LibreLane
read_db $db_file

# Load design constraints (Clock, I/O delays, etc.)
read_sdc $sdc_file

# Get the collection of the worst timing paths
set paths [find_timing_paths -from [all_registers] -to [all_registers] -group_path_count $num_paths -sort_by_slack]
set target_paths {}

foreach path $paths {
    # Extract the slack
    set slack [get_property $path slack]
    
    # Extract the endpoint
    set pin [get_property $path endpoint]
    set pin_name [get_property $pin full_name]
    
    # Navigate from the endpoint to the connected logical net
    set net [get_nets -of_objects $pin]
    if { $net != "NULL" } {
    	set net_name [get_property $net name]
    } else {
    	set net_name "UNCONNECTED"
    }
    
    puts "Found Path -> Pin: $pin_name | Slack: $slack | Net: $net_name"
    lappend target_paths "	\"$net_name\""
}

# Write the results to a JSON file
set file_out [open $paths_file w]
puts $file_out "\[\n[join $target_paths ",\n"]\n\]"
close $file_out

puts "Extraction completed. Data saved to '$paths_file'"
exit
